<a href="https://colab.research.google.com/github/karthicsalem/ipynb_trial/blob/master/CSE18231-POMLlab3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

2.Import necessary packages

In [1]:
import pandas as pd
import numpy as np
from scipy.stats import mode
from sklearn.preprocessing import MinMaxScaler
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

*   1.Download practice_data.csv
*   3.Import dataset

In [2]:
df=pd.read_csv('/content/drive/My Drive/practice_data.csv')

4.How many columns in the dataset?

In [3]:
columns=df.shape[1]
print("No of Columns:",columns)

No of Columns: 5

5.Identify the categorical variabales

In [4]:
df.head(10)

   Cust_id State   Age   Salary Response
0        1    TN  18.0  14603.0      Yes
1        2    KL  27.0  40727.0       No
2        3    KA  27.0  38029.0      Yes
3        4    AP  19.0  35793.0      Yes
4        5    AP  27.0      NaN      Yes
5        6    AP  21.0  37941.0      Yes
6        7    KL  22.0  28012.0       No
7        8    KL  20.0  10608.0      Yes
8        9    TN  29.0  41566.0       No
9       10    TN  22.0  27060.0      Yes

State is a categorical value

6.How many columns have missing values?

In [5]:
li=df.isnull().sum()>0
print(li.sum(),"Columns with NAN values")

4 Columns with NAN values

7.Replace missing values of categorical variables with mode

In [6]:
df['State'] = df['State'].fillna(df['State'].mode()[0])
print("No of Null values after replacing:",df['State'].isnull().sum())

No of Null values after replacing: 0

8.Replace missing values of age column with median

In [7]:
df['Age'].fillna(df['Age'].median(), inplace=True)
print("No of Null values after replacing:",df['Age'].isnull().sum())

No of Null values after replacing: 0

9.Replace missing values of salary with mean salary

In [8]:
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
print("No of Null values after replacing:",df['Salary'].isnull().sum())

No of Null values after replacing: 0

10.In case of any NaN value in response column, delete the entire instance

In [9]:
print('Rows before Null Removal:',df.shape[0])
df = df[df['Response'].isnull()==False]
print('Rows After Null Removal:',df.shape[0])

Rows before Null Removal: 49
Rows After Null Removal: 46

11.Find the range of age

In [10]:
print('Range of Age:',df['Age'].max() - df['Age'].min())

Range of Age: 13.0

12.Apply min-max scaling on salary to transform it into (0,1)

In [11]:
scaler = MinMaxScaler()
X=np.array(df['Salary']).reshape(46,1)
scaler.fit(X)
df['Salary'] = scaler.transform(X)
df.head(10)

   Cust_id State   Age    Salary Response
0        1    TN  18.0  0.106151      Yes
1        2    KL  27.0  0.800292       No
2        3    KA  27.0  0.728604      Yes
3        4    AP  19.0  0.669191      Yes
4        5    AP  27.0  0.465899      Yes
5        6    AP  21.0  0.726265      Yes
6        7    KL  22.0  0.462442       No
7        8    KL  20.0  0.000000      Yes
8        9    TN  29.0  0.822585       No
9       10    TN  22.0  0.437146      Yes